'''
快速理解六十四卦
1．乾卦：------自强不息
2．坤卦：------厚德载物
3．屯卦：------起始维艰
4．蒙卦：------蒙以养正
5．需卦：------守正待机
6．讼卦：------慎争戒讼
7．师卦：------行险而顺
8．比卦：------诚信团结
9．小畜卦：----蓄养待进
10．履卦：-----脚踏实地
11．泰卦：-----上下互通
12．否卦：-----不交不通
13．同人卦：---上下和同
14．大有卦：---顺天依时
15．谦卦：-----内高外低
16．豫卦：-----顺时依势
17．随卦：-----随时变通
18．蛊卦：-----振疲起衰
19．临卦：-----教民保民
20．观卦：-----观下瞻上
21．噬嗑卦:-----宽严相济
22．贲卦：-----饰外扬质
23．剥卦：-----顺势而止
24．复卦：-----寓动于顺
25．无妄卦：---无妄而得
26．大畜卦:----修身富德
27．颐卦:------自食其力
28．大过卦:----行动非常
29．坎卦：-----临险用险
30．离卦：-----附和依托
31．咸卦：-----相互感应
32．恒卦：-----恒心有成
33．遁卦：-----明哲保身
34．大壮卦:---- 壮勿妄动
35．晋卦:------发展求进
36．明夷卦：---依时养晦
37．家人卦：---诚威治家
38．睽卦：-----异中求同
39．蹇卦: -----险阻在前
40．解卦：-----柔道致治
41．损卦：-----损益制衡
42．益卦：-----损上益下
43．夬卦：-----决而能和
44．姤卦：-----风行天下
45．萃卦：-----荟萃聚集
46．升卦：-----日渐高大
47．困卦：-----困境求通
48．井卦：-----相互为养
49．革卦：-----顺天而变
50．鼎卦：-----稳重图变
51．震卦：-----临危不乱
52．艮卦：-----动静适时
53．渐卦：-----渐进蓄德
54．归妹卦：---立家兴业
55．丰卦：-----日中则斜
56．旅卦: ------路途匆匆
57．巽卦：-----谦逊受益
58．兑卦：-----刚内柔外
59．涣卦：-----拯救涣散
60．节卦：-----有节方成
61．中孚卦：---诚信立身
62．小过卦：---行动有度
63．既济卦：---盛极将衰
64．未济卦：---事业未竟
'''
'''原来换个文件夹路径名称啥的就叫重构'''
import random
guaxiang = []
for i in range(6):
    guaxiang.append(random.randint(1, 2))
print(guaxiang)