case_list = ['证券行情_订单簿_深市主板正常委托',
'证券行情_订单簿_沪市主板正常委托',
'证券行情_订单簿_创业版正常委托',
'证券行情_订单簿_科创版正常委托',
'证券行情_订单簿_边界值正常委托',
'证券行情_订单簿_深市主板不平衡委托',
'证券行情_订单簿_沪市主板不平衡委托',
'证券行情_订单簿_创业版不平衡委托',
'证券行情_订单簿_科创版不平衡委托',
'证券行情_订单簿_边界值不平衡委托',
'证券行情_订单簿_深市主板正常委托_正常成交',
'证券行情_订单簿_沪市主板正常委托_正常成交',
'证券行情_订单簿_创业版正常委托_正常成交',
'证券行情_订单簿_科创版正常委托_正常成交',
'证券行情_订单簿_边界值正常委托_正常成交',
'证券行情_订单簿_深市主板正常委托_不平衡委托',
'证券行情_订单簿_沪市主板正常委托_不平衡委托',
'证券行情_订单簿_创业版正常委托_不平衡委托',
'证券行情_订单簿_科创版正常委托_不平衡委托',
'证券行情_订单簿_边界值正常委托_不平衡委托',
'证券行情_订单簿_深市主板不平衡委托_正常成交',
'证券行情_订单簿_沪市主板不平衡委托_正常成交',
'证券行情_订单簿_创业版不平衡委托_正常成交',
'证券行情_订单簿_科创版不平衡委托_正常成交',
'证券行情_订单簿_边界值不平衡委托_正常成交',
'证券行情_订单簿_深市主板不平衡委托_平衡成交',
'证券行情_订单簿_沪市主板不平衡委托_平衡成交',
'证券行情_订单簿_创业版不平衡委托_平衡成交',
'证券行情_订单簿_科创版不平衡委托_平衡成交',
'证券行情_订单簿_边界值不平衡委托_平衡成交',
'证券行情_订单簿_深市主板正常委托_买单触发价格笼子',
'证券行情_订单簿_沪市主板正常委托_买单触发价格笼子',
'证券行情_订单簿_创业版正常委托_买单触发价格笼子',
'证券行情_订单簿_科创版正常委托_买单触发价格笼子',
'证券行情_订单簿_边界值正常委托_买单触发价格笼子',
'证券行情_订单簿_深市主板正常委托_卖单触发价格笼子',
'证券行情_订单簿_沪市主板正常委托_卖单触发价格笼子',
'证券行情_订单簿_创业版正常委托_卖单触发价格笼子',
'证券行情_订单簿_科创版正常委托_卖单触发价格笼子',
'证券行情_订单簿_边界值正常委托_卖单触发价格笼子',
'证券行情_订单簿_深市主板不平衡状态_买单触发价格笼子',
'证券行情_订单簿_沪市主板不平衡状态_买单触发价格笼子',
'证券行情_订单簿_创业版不平衡状态_买单触发价格笼子',
'证券行情_订单簿_科创版不平衡状态_买单触发价格笼子',
'证券行情_订单簿_深市主板不平衡状态_卖单触发价格笼子',
'证券行情_订单簿_沪市主板不平衡状态_卖单触发价格笼子',
'证券行情_订单簿_创业版不平衡状态_卖单触发价格笼子',
'证券行情_订单簿_科创版不平衡状态_卖单触发价格笼子',
'证券行情_订单簿_深市主板平衡状态_异常成交信息',
'证券行情_订单簿_沪市主板平衡状态_异常成交信息',
'证券行情_订单簿_创业版平衡状态_异常成交信息',
'证券行情_订单簿_科创版平衡状态_异常成交信息',
'证券行情_订单簿_深市主板不平衡状态_异常成交信息',
'证券行情_订单簿_沪市主板不平衡状态_异常成交信息',
'证券行情_订单簿_创业版不平衡状态_异常成交信息',
'证券行情_订单簿_科创版不平衡状态_异常成交信息',
'证券行情_订单簿_实盘委托+成交测试',
]
times = 1
for i in case_list:
    print(i)
    name = 'case' + str(times) + '_' + i + '.log'
    print(name)
    case_file = open(name,'w')
    file = open('case_' + str(times) + '_' + i + '.log', 'r')
    try:
        k = file.read()
        case_file.write(k)
    except Exception as error:
        print(error)
    times += 1
    file.close()
    case_file.close()
print('done')